MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ128GP310A/mcu.h
extern void *_DMA_BASE __attribute__((far));


/* -------------------------------------------------------- */
/* Macros for setting device configuration registers        */
/* -------------------------------------------------------- */

/* Register FBS (0xf80000)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBS;
#define _FBS(x) __attribute__((address(0xf80000),deprecated_definition("consider migrating to #pragma config"),section("__FBS.sec"),space(prog))) __prog__ uint16_t _FBS = (x);

/*
** Only one invocation of FBS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBS.
** Multiple options may be combined, as shown:
**
** _FBS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write Protect:
**     BWRP_WRPROTECT_ON    Boot segment is write-protected
**     BWRP_WRPROTECT_OFF   Boot Segment may be written
**
**   Boot Segment Program Flash Code Protection:
**     BSS_LARGE_FLASH_HIGH High Security, Large-sized Boot Flash
**     BSS_HIGH_LARGE_BOOT_CODEHigh Security, Large-sized Boot Flash
**     BSS_MEDIUM_FLASH_HIGHHigh Security, Medium-sized Boot Flash
**     BSS_HIGH_MEDIUM_BOOT_CODEHigh Security, Medium-sized Boot Flash
**     BSS_SMALL_FLASH_HIGH High Security, Small-sized Boot Flash
**     BSS_HIGH_SMALL_BOOT_CODEHigh Security, Small-sized Boot Flash
**     BSS_LARGE_FLASH_STD  Standard Security, Large-sized Boot Flash
**     BSS_STRD_LARGE_BOOT_CODEStandard Security, Large-sized Boot Flash
**     BSS_MEDIUM_FLASH_STD Standard Security, Medium-sized Boot Flash
**     BSS_STRD_MEDIUM_BOOT_CODEStandard Security, Medium-sized Boot Flash
**     BSS_SMALL_FLASH_STD  Standard Security, Small-sized Boot Flash
**     BSS_STRD_SMALL_BOOT_CODEStandard Security, Small-sized Boot Flash
**     BSS_NO_FLASH         No Boot program Flash segment
**     BSS_NO_BOOT_CODE     No Boot program Flash segment
**
**   Boot Segment RAM Protection:
**     RBS_LARGE_RAM        Large-sized Boot RAM
**     RBS_LARGE_BOOT_RAM   Large-sized Boot RAM
**     RBS_MEDIUM_RAM       Medium-sized Boot RAM
**     RBS_MEDIUM_BOOT_RAM  Medium-sized Boot RAM
**     RBS_SMALL_RAM        Small-sized Boot RAM
**     RBS_SMALL_BOOT_RAM   Small-sized Boot RAM
**     RBS_NO_RAM           No Boot RAM
**     RBS_NO_BOOT_RAM      No Boot RAM
**
*/

#define BWRP_WRPROTECT_ON    0x00CE
#define BWRP_WRPROTECT_OFF   0x00CF

#define BSS_LARGE_FLASH_HIGH 0x00C1
#define BSS_HIGH_LARGE_BOOT_CODE 0x00C1
#define BSS_MEDIUM_FLASH_HIGH 0x00C3
#define BSS_HIGH_MEDIUM_BOOT_CODE 0x00C3
#define BSS_SMALL_FLASH_HIGH 0x00C5
#define BSS_HIGH_SMALL_BOOT_CODE 0x00C5
#define BSS_LARGE_FLASH_STD  0x00C9
#define BSS_STRD_LARGE_BOOT_CODE 0x00C9
#define BSS_MEDIUM_FLASH_STD 0x00CB
#define BSS_STRD_MEDIUM_BOOT_CODE 0x00CB
#define BSS_SMALL_FLASH_STD  0x00CD
#define BSS_STRD_SMALL_BOOT_CODE 0x00CD
#define BSS_NO_FLASH         0x00CF
#define BSS_NO_BOOT_CODE     0x00CF

#define RBS_LARGE_RAM        0x000F
#define RBS_LARGE_BOOT_RAM   0x000F
#define RBS_MEDIUM_RAM       0x004F
#define RBS_MEDIUM_BOOT_RAM  0x004F
#define RBS_SMALL_RAM        0x008F
#define RBS_SMALL_BOOT_RAM   0x008F
#define RBS_NO_RAM           0x00CF
#define RBS_NO_BOOT_RAM      0x00CF

/* Register FSS (0xf80002)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSS;
#define _FSS(x) __attribute__((address(0xf80002),deprecated_definition("consider migrating to #pragma config"),section("__FSS.sec"),space(prog))) __prog__ uint16_t _FSS = (x);

/*
** Only one invocation of FSS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSS.
** Multiple options may be combined, as shown:
**
** _FSS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Secure Segment Program Write Protect:
**     SWRP_WRPROTECT_ON    Secure segment is write protected
**     SWRP_WRPROTECT_OFF   Secure Segment may be written
**
**   Secure Segment Program Flash Code Protection:
**     SSS_LARGE_FLASH_HIGH High Security, Large-sized Secure Flash
**     SSS_HIGH_LARGE_SEC_CODEHigh Security, Large-sized Secure Flash
**     SSS_MEDIUM_FLASH_HIGHHigh Security, Medium-sized Secure Flash
**     SSS_HIGH_MEDIUM_SEC_CODEHigh Security, Medium-sized Secure Flash
**     SSS_SMALL_FLASH_HIGH High Security, Small-sized Secure Flash
**     SSS_HIGH_SMALL_SEC_CODEHigh Security, Small-sized Secure Flash
**     SSS_LARGE_FLASH_STD  Standard Security, Large-sized Secure Flash
**     SSS_STRD_LARGE_SEC_CODEStandard Security, Large-sized Secure Flash
**     SSS_MEDIUM_FLASH_STD Standard Security, Medium-sized Secure Flash
**     SSS_STRD_MEDIUM_SEC_CODEStandard Security, Medium-sized Secure Flash
**     SSS_SMALL_FLASH_STD  Standard Security, Small-sized Secure Flash
**     SSS_STRD_SMALL_SEC_CODEStandard Security, Small-sized Secure Flash
**     SSS_NO_FLASH         No Secure Segment
**     SSS_NO_SEC_CODE      No Secure Segment
**
**   Secure Segment Data RAM Protection:
**     RSS_LARGE_RAM        Large-sized Secure RAM
**     RSS_LARGE_SEC_RAM    Large-sized Secure RAM
**     RSS_MEDIUM_RAM       Medium-sized Secure RAM
**     RSS_MEDIUM_SEC_RAM   Medium-sized Secure RAM
**     RSS_SMALL_RAM        Small-sized Secure RAM
**     RSS_SMALL_SEC_RAM    Small-sized Secure RAM
**     RSS_NO_RAM           No Secure RAM
**     RSS_NO_SEC_RAM       No Secure RAM
**
*/

#define SWRP_WRPROTECT_ON    0xFFCE
#define SWRP_WRPROTECT_OFF   0xFFCF

#define SSS_LARGE_FLASH_HIGH 0xFFC1
#define SSS_HIGH_LARGE_SEC_CODE 0xFFC1
#define SSS_MEDIUM_FLASH_HIGH 0xFFC3
#define SSS_HIGH_MEDIUM_SEC_CODE 0xFFC3
#define SSS_SMALL_FLASH_HIGH 0xFFC5
#define SSS_HIGH_SMALL_SEC_CODE 0xFFC5
#define SSS_LARGE_FLASH_STD  0xFFC9
#define SSS_STRD_LARGE_SEC_CODE 0xFFC9
#define SSS_MEDIUM_FLASH_STD 0xFFCB
#define SSS_STRD_MEDIUM_SEC_CODE 0xFFCB
#define SSS_SMALL_FLASH_STD  0xFFCD
#define SSS_STRD_SMALL_SEC_CODE 0xFFCD
#define SSS_NO_FLASH         0xFFCF
#define SSS_NO_SEC_CODE      0xFFCF

